app/Views/logistics/dashboard.php

SELECT SUM(`chargeable_weight`) AS `chargeable_weight`
FROM `shipment_items`
WHERE `booking_id` = '1'
 LIMIT 1
SELECT (rate * weight) + ddc + ssc + btc + flc + doc + inbound_tsp + outbound_tsp + tcp + utility_charges + xray_charges + ado + awb_fees_agent + awb_fees_carrier + admin_charges + delivery_order_charges + inbound_handling + inbound_storage + outbound_storage + misc_charges AS total_amount
FROM `sales_charges`
WHERE `booking_id` = '1'
 LIMIT 1
---
                <tbody>
                    <?php foreach($all_bookings as $booking):
                        $shipmentModel = new \App\Models\ShipmentItemModel();
                        $totalWeight = $shipmentModel->selectSum('chargeable_weight')
                                                   ->where('booking_id', $booking['id'])
                                                   ->first()['chargeable_weight'] ?? 0;
                        $salesModel = new \App\Models\SalesChargeModel();
                        $totalAmount = $salesModel->select('(rate * weight) + ddc + ssc + btc + flc + doc + inbound_tsp + outbound_tsp + tcp + utility_charges + xray_charges + ado + awb_fees_agent + awb_fees_carrier + admin_charges + delivery_order_charges + inbound_handling + inbound_storage + outbound_storage + misc_charges AS total_amount', false)->where('booking_id', $booking['id'])->first()['total_amount'] ?? 0;