app/Views/logistics/dashboard.php

                            <td>
                                <?php
                                    $custModel = new \App\Models\CustomerModel();
                                    $cust = $custModel->find($booking['customer_id'] ?? 0);
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = 0

                            <td>
                                <?php
                                    $shipModel = new \App\Models\ShipmentItemModel();
                                    $totalWgt = $shipModel->selectSum('final_chargeable_weight')->where('booking_id', $booking['id'])->first()['final_chargeable_weight'] ?? 0;
---
SELECT SUM(`final_chargeable_weight`) AS `final_chargeable_weight`
FROM `shipment_items`
WHERE `booking_id` = '4'
 LIMIT 1