app/Controllers/AdminController.php

    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/logistics');
        }

        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function ajaxDatatable()
    {
        if (session()->get('role') !== 'admin') {
            return $this->response->setJSON(['error' => 'Admin only!']);
        }

        $post = $this->request->getPost();
        $draw = (int) ($post['draw'] ?? 1);
        $start = (int) ($post['start'] ?? 0);
        $length = (int) ($post['length'] ?? 10);
        $searchValue = $post['search']['value'] ?? '';

        $userModel = new UserModel();
        $builder = $userModel->builder();

        // Total records
        $totalRecords = $builder->countAllResults(false);

        // Search
        if (!empty($searchValue)) {
            $builder->groupStart()
                    ->like('username', $searchValue)
                    ->orLike('email', $searchValue)
                    ->orLike('role', $searchValue)
                    ->groupEnd();
        }
        $filteredRecords = $builder->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `users`