app/Controllers/AdminController.php

    public function index()
    {
        if (! $this->checkRootAdmin()) {
            return redirect()->to('/logistics')->with('error', 'User Management is centralized under MA Logistic root administration.');
        }

        $userModel = new UserModel();
        $companyModel = new CompanyModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 25