app/Controllers/AuthController.php

    public function login()
    {
        // TEMPORARY FIX: Hash any plain-text passwords in the DB
        $db = \Config\Database::connect();
        $users = $db->table('users')->get()->getResultArray();
---
SELECT *
FROM `users`

    public function attemptLogin()
    {
        $userModel = new UserModel();
        $credentials = [
            'username' => $this->request->getPost('username'),
            'password' => $this->request->getPost('password')
        ];

        // --- TEMPORARY AUTO-FIX & DEBUGGING ---
        $db = \Config\Database::connect();
        $dbUser = $db->table('users')->where('username', $credentials['username'])
                     ->orWhere('email', $credentials['username'])->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
OR `email` = 'admin'