app/Controllers/Logistics.php

SELECT *
FROM `shipment_items`
WHERE `booking_id` = '1'
SELECT *
FROM `sales_charges`
WHERE `booking_id` = '1'
 LIMIT 1
---
public function edit($id)
{
    $this->checkPermission('can_edit');

    $bookingModel = new BookingModel();
    $shipmentModel = new ShipmentItemModel();
    $salesModel = new SalesChargeModel();
    //$companyModel = new CompanyModel();

    $booking = $bookingModel->getFullBooking($id);
    if (!$booking) {
        return redirect()->back()->with('error', 'Booking not found!');
    }

    $data = [
        'booking' => $booking,
        'shipments' => $shipmentModel->where('booking_id', $id)->findAll(),
        'sales' => $salesModel->where('booking_id', $id)->first(),