app/Controllers/Logistics.php

public function index()
{
    $data = [
        'user' => session()->get(),
        'permissions' => session()->get('permissions') ?? [],
        'company_name' => session()->get('selected_company_name'),
        'company_id' => session()->get('selected_company_id')
    ];

    $companyId = session()->get('selected_company_id');
    if ($companyId) {
        $bookingModel = new BookingModel();
        $data['stats'] = $bookingModel->getCompanyStats($companyId);
        $data['recent_bookings'] = $bookingModel->getCompanyBookings($companyId, 10); // Show 10 bookings
        $data['all_bookings'] = $bookingModel->where('company_id', $companyId)
                                           ->orderBy('booking_date', 'DESC')
                                           ->findAll(50); // All recent 50
---
SELECT *
FROM `bookings`
WHERE `company_id` = '1'
ORDER BY `booking_date` DESC
 LIMIT 50

  public function view($id)
  {
    $bookingModel = new BookingModel();
    $shipmentModel = new ShipmentItemModel();
    $salesModel = new SalesChargeModel();

    $booking = $bookingModel->getFullBooking($id);
    if (!$booking) {
        return redirect()->back()->with('error', 'Booking not found!');
    }

    $shipments = $shipmentModel->where('booking_id', $id)->findAll();
    $sales = $salesModel->where('booking_id', $id)->first();
---
SELECT *
FROM `shipment_items`
WHERE `booking_id` = '1'
SELECT *
FROM `sales_charges`
WHERE `booking_id` = '1'
 LIMIT 1

public function edit($id)
{
    $this->checkPermission('can_edit');

    $bookingModel = new BookingModel();
    $shipmentModel = new ShipmentItemModel();
    $salesModel = new SalesChargeModel();
    //$companyModel = new CompanyModel();

    $booking = $bookingModel->getFullBooking($id);
    if (!$booking) {
        return redirect()->back()->with('error', 'Booking not found!');
    }

    $data = [
        'booking' => $booking,
        'shipments' => $shipmentModel->where('booking_id', $id)->findAll(),
        'sales' => $salesModel->where('booking_id', $id)->first(),
---
SELECT *
FROM `shipment_items`
WHERE `booking_id` = '1'
SELECT *
FROM `sales_charges`
WHERE `booking_id` = '1'
 LIMIT 1

public function companySelection()
{
    // Only redirect if NOT logged in
    if (!session()->get('user_id')) {
        return redirect()->to('/login');
    }

    // If already selected company, go to dashboard
    if (session()->get('selected_company_id')) {
        return redirect()->to('/logistics');
    }

    $companyModel = new CompanyModel();
    $data = [
        'user' => session()->get(),
        'companies' => $companyModel->findAll()
---
SELECT *
FROM `companies`

  public function setCompany()
  {
    $companyId = $this->request->getPost('company_id');

    if ($companyId) {
        // Verify company exists
        $companyModel = new CompanyModel();
        $company = $companyModel->find($companyId);
---
SELECT *
FROM `companies`
WHERE `companies`.`id` = '2'

 public function manageBookings()
 {

    $companyId = session()->get('selected_company_id');
    if (!$companyId) {
        return redirect()->to('/company-selection');
    }

    $bookingModel = new BookingModel();
    $data = [
        'bookings' => $bookingModel->where('company_id', $companyId)
                                  ->orderBy('booking_date', 'DESC')
                                  ->findAll(),
        'company_name' => session()->get('selected_company_name'),
        'company_id' => $companyId,
        'user' => session()->get(),
        'permissions' => session()->get('permissions') ?? []
    ];
---
SELECT *
FROM `bookings`
WHERE `company_id` = '1'
ORDER BY `booking_date` DESC