app/Controllers/Logistics.php

SELECT *
FROM `shipment_items`
WHERE `booking_id` = '3'
---
        $b['consignee'] = !empty($shipDetails['consignees']) ? $shipDetails['consignees'] : '-';

        // Sum chargeable weight
        $wgtRow = $db->table('shipment_items')
                     ->selectSum('final_chargeable_weight', 'total_weight')
                     ->where('booking_id', $b['id'])
                     ->get()->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `bookings` `b`
LEFT JOIN (SELECT booking_id, SUM(final_chargeable_weight) AS total_weight FROM shipment_items GROUP BY booking_id) si ON `si`.`booking_id` = `b`.`id`
LEFT JOIN (SELECT booking_id, ((COALESCE(rate,0) * COALESCE(weight,0)) + COALESCE(ddc,0) + COALESCE(ssc,0) + COALESCE(btc,0) + COALESCE(flc,0) + COALESCE(doc,0) + COALESCE(inbound_tsp,0) + COALESCE(outbound_tsp,0) + COALESCE(tcp,0) + COALESCE(utility_charges,0) + COALESCE(xray_charges,0) + COALESCE(ado,0) + COALESCE(awb_fees_agent,0) + COALESCE(awb_fees_carrier,0) + COALESCE(admin_charges,0) + COALESCE(delivery_order_charges,0) + COALESCE(inbound_handling,0) + COALESCE(inbound_storage,0) + COALESCE(outbound_storage,0) + COALESCE(misc_charges,0)) AS total_amount FROM sales_charges) sc ON `sc`.`booking_id` = `b`.`id`
WHERE `b`.`company_id` = '1'
---
  public function delete($id = null)
  {
    $perm = $this->checkPermission('can_create');
    if ($perm !== true) {
        return $perm;
    }

    $id = (int) $id;
    if ($id < 1) {
        session_write_close();
        return $this->response->setStatusCode(400)->setJSON([
            'success' => false,
            'status'  => 'error',
            'message' => 'Invalid booking id',
        ]);
    }

    $bookingModel = new BookingModel();
    $booking = $bookingModel->find($id);

    if (!$booking || (int) $booking['company_id'] !== (int) session()->get('selected_company_id')) {