app/Controllers/MasterController.php

    public function editCompany()
    {
        if ($r = $this->requireAdmin()) return $r;
        $companyId = $this->companyId();
        if (!$companyId) return redirect()->to('/company-selection');

        return view('masters/company_settings', [
            'company' => (new CompanyModel())->find($companyId),
            'user'    => session()->get(),
        ]);
---
SELECT *
FROM `companies`
WHERE `companies`.`id` = 1