app/Models/AirlineModel.php

    public function getByCompany(int $companyId): array
    {
        return $this->where('company_id', $companyId)
                    ->orderBy('name')
                    ->findAll();
---
SELECT *
FROM `airlines`
WHERE `company_id` = 1
ORDER BY `name`