app/Models/BookingModel.php

SELECT `bookings`.*, `companies`.`name` as `company_name`, `users`.`username` as `created_by_name`
FROM `bookings`
JOIN `companies` ON `companies`.`id` = `bookings`.`company_id`
JOIN `users` ON `users`.`id` = `bookings`.`created_by`
WHERE `bookings`.`id` = '3'
---
    public function getFullBooking($id)
    {
        return $this->select('bookings.*, companies.name as company_name, users.username as created_by_name')
        ->join('companies', 'companies.id = bookings.company_id')
        ->join('users', 'users.id = bookings.created_by')
        ->find($id);

SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `company_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `shipment_items` `si`
JOIN `bookings` `b` ON `b`.`id` = `si`.`booking_id`
WHERE `b`.`company_id` = '1'
SELECT SUM((rate * weight) + ddc + ssc + btc + flc + doc + inbound_tsp + outbound_tsp + tcp + utility_charges + xray_charges + ado + awb_fees_agent + awb_fees_carrier + admin_charges + delivery_order_charges + inbound_handling + inbound_storage + outbound_storage + misc_charges) AS total_amount
FROM `sales_charges` `sc`
JOIN `bookings` `b` ON `b`.`id` = `sc`.`booking_id`
WHERE `b`.`company_id` = '1'
---
    public function getCompanyStats($companyId)
    {
        $totalBookings = $this->where('company_id', $companyId)->countAllResults();

        $db = \Config\Database::connect();
        $totalShipments = $db->table('shipment_items si')
        ->join('bookings b', 'b.id = si.booking_id')
        ->where('b.company_id', $companyId)
        ->countAllResults();

        $totalCharges = $db->table('sales_charges sc')
        ->join('bookings b', 'b.id = sc.booking_id')
        ->where('b.company_id', $companyId)
        ->select('SUM((rate * weight) + ddc + ssc + btc + flc + doc + inbound_tsp + outbound_tsp + tcp + utility_charges + xray_charges + ado + awb_fees_agent + awb_fees_carrier + admin_charges + delivery_order_charges + inbound_handling + inbound_storage + outbound_storage + misc_charges) AS total_amount', false)
        ->get()
        ->getRowArray()['total_amount'] ?? 0;

SELECT *
FROM `bookings`
WHERE `company_id` = '1'
ORDER BY `id` DESC
 LIMIT 10
---
   public function getCompanyBookings($companyId, $limit = 5)
   {
    return $this->where('company_id', $companyId)
    ->orderBy('id', 'DESC')
    ->limit($limit)
    ->findAll();