app/Models/CustomerModel.php

SELECT *
FROM `customers`
WHERE `company_id` = 1
AND `is_active` = 1
ORDER BY `name`
---
    public function getByCompany(int $companyId): array
    {
        return $this->where('company_id', $companyId)
                    ->where('is_active', 1)
                    ->orderBy('name')
                    ->findAll();