app/Models/LookupValueModel.php

    public function getByType(int $companyId, string $type): array
    {
        return $this->where('company_id', $companyId)
                    ->where('type', $type)
                    ->orderBy('sort_order')
                    ->orderBy('value')
                    ->findAll();
---
SELECT *
FROM `lookup_values`
WHERE `company_id` = 1
AND `type` = 'origin'
ORDER BY `sort_order`, `value`