app/Models/TransporterModel.php

SELECT *
FROM `transporters`
WHERE `company_id` = 1
ORDER BY `name`
---
    public function getByCompany(int $companyId): array
    {
        return $this->where('company_id', $companyId)
                    ->orderBy('name')
                    ->findAll();