app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1
---
    public function attemptLogin($credentials)
    {
        // Auto-seed or auto-heal admin account if missing or invalid
        $this->ensureDefaultAdmin($credentials);

        $user = $this->where('username', $credentials['username'])
                     ->orWhere('email', $credentials['username'])
                     ->first();